cask_args appdir: '/Applications'

# tap
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

# brew
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'boost'
brew 'pkg-config'
brew 'libtool'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'freetype'
brew 'imagemagick'
brew 'emacs'
brew 'cask'
brew 'cmake'
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'git'
brew 'libgpg-error'
brew 'libksba'
brew 'libyaml'
brew 'mas'
brew 'openssl'
brew 'mysql'
brew 'node'
brew 'readline'
brew 'postgresql'

# mas
mas 'Memory Clean', id: 451444120
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'The Unarchiver', id: 425424353
mas 'Wunderlist', id: 410628904
mas 'Numbers', id: 409203825

# cask
cask 'adium'
cask 'adobe-air'
cask 'android-studio'
cask 'anki'
cask 'arduino'
cask 'atom'
cask 'bartender'
cask 'caffeine'
cask 'calibre'
cask 'chicken'
cask 'controlplane'
cask 'dash'
cask 'docker-toolbox'
cask 'dropbox'
cask 'evernote'
cask 'filezilla'
cask 'flash'
cask 'flip4mac'
cask 'flux'
cask 'freeplane'
cask 'fritzing'
cask 'gimp'
cask 'gnucash'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'gpgtools'
cask 'iterm2'
cask 'itsycal'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'jdiskreport'
cask 'kdiff3'
cask 'keepassx0'
cask 'libreoffice'
cask 'mactex'
cask 'minecraft'
cask 'music-manager'
cask 'mysqlworkbench'
cask 'openscad'
cask 'paintbrush'
cask 'postman'
cask 'pinentry-mac'
cask 'quicksilver'
cask 'second-life-viewer'
cask 'sketchup'
cask 'skype'
cask 'slack'
cask 'slic3r'
cask 'sublime-text'
cask 'smcfancontrol'
cask 'sourcetree'
cask 'steam'
cask 'stellarium'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'transmission'
cask 'truecrypt71a'
cask 'unrarx'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'
